# OLDForceStrToReal

## Description
Converts force string to real number and returns the result.

```pascal
FUNCTION OLDForceStrToReal(
				forceString   : STRING;
				VAR realValue : REAL): BOOLEAN;
```

```python
def vs.OLDForceStrToReal(forceString):
    return (BOOLEAN, realValue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|forceString|STRING|   |
|realValue|REAL|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis